{
  "adult": false, 
  "also_known_as": [], 
  "biography": "A native of Southern California, Julia Ling first expressed her creative  side at age 3 when she drew pictures of her parents drinking tea. By  age 6, her artwork had been featured in local magazines, festivals and  newspapers, including the Pasadena Star News, which gave her a  front-page spread. Also at age 6, Ling wrote and narrated a creative  story that won her the \"Best Storyteller Award\" by the Chinese World  Newspaper. By age 9, Ling was performing award-winning solo dances  throughout California, and her umbrella dances had aired on national  television.\n\nIn high school, Ling was student body president and  president of German Club, Amnesty International, Literature Society and  Junior Statesmen Debate Team. She competed in dance, varsity tennis and  swimming. In 1997, Congressman David Dreier recognized Ling for her  community service at the local hospital. At age 16, she was selected as a  state finalist in the Miss America Pageant and after nine years of  playing the piano, graduated from the Royal Board of Music. She  graduated high school second in her class with a 4.0 GPA and perfect SAT  scores.\n\nPursuing a career in medicine, Ling majored in  biomedical chemical engineering at the University of California, Los  Angeles. She was Treasurer of Chemical Engineering Society, Vice  President of the Engineering Society of UCLA and honorary member of the  Society of Women Engineers. She left it all to pursue her love of  performing.\n\nIn 2003, Julia Ling made her network television debut  on Buffy the Vampire Slayer, playing opposite Sarah Michelle Gellar.  Over the next two years, she starred in over 20 independent short films  and returned to prime time television in roles on House (FOX) and ER  (NBC) in 2006. She guest starred in the recurring role of Kim Tao on the  critically acclaimed Studio 60 On the Sunset Strip (NBC). Her next  major guest starring role was on the television drama ER, playing the  recurring character of Mae Lee Park, a surgical intern. She also guest  starred in The O.C., and Grey's Anatomy.\n\nMost notably known for  her work on prime time television, Ling starred as the popular Anna Wu  on NBC's CHUCK. After voicing and filming the live action character  \"Izumi\" for the video game, Command and Conquer (EA), Ling toured the  world for autograph signing and charity fundraising.\n\nIn the 2007  Jackie Chan Disciples martial arts competition, Ling was selected as one  of the top four finalists to compete in the International Top 100. Her  performance also won her \"Best Acting Award\". In 2011, Ling joined the  cast of FOX sitcom, I Hate My Teenage Daughter and voiced a sketch for  Conan O'Brien.\n\nMost recently, she worked on a movie performing  opposite Academy Award winner Adrien Brody. The movie will premiere in  theaters June, 2012.", 
  "birthday": "1983-02-14", 
  "deathday": "", 
  "homepage": "", 
  "id": 1223891, 
  "imdb_id": "nm1788146", 
  "name": "Julia Ling", 
  "place_of_birth": "Southern California - California - USA", 
  "popularity": 0.002552, 
  "profile_path": "/hzmkRep3NnFa3BA1v50hgRxyBYa.jpg"
}