{
  "adult": false, 
  "also_known_as": [
    "Brett Allen Rickaby"
  ], 
  "biography": "​From IMDb;\n\nBorn December 15, 1964, the son of a dairy farmer in Shafer, Minnesota (population 81), Brett Rickaby attended Chisago Lakes High School where, as a senior, he received a letter from a professor at the University of Minnesota in Duluth encouraging him to attend their theatre program. Taking this as a sign, he enrolled at UMD and did not get cast in a single production his first year. Briefly, he considered hanging it up to become a tree trimmer, but re-dedicated himself and was cast in seven full-scale productions his sophomore year. By his senior year (1987) he had won what is roughly the acting equivalent of Heisman Trophy, The National Irene Ryan Acting Award at the Kennedy Center in Washington, D.C.\nThat fall he received a scholarship to attend New York University's MFA program with contemporaries and classmates Peter Krause (\"Six Feet Under\" (2001)), Camryn Manheim (\"The Practice\" (1997), Marcia Gay Harden (Pollock (2000)), Rainn Wilson (\"The Office\" (2005)) and Debra Messing (\"Will &amp; Grace\" (1998)), and originated two plays with Pulitzer Prize-winning playwright and director Tony Kushner (\"Angels in America\" (2003)).\nRickaby performed in numerous New York and regional theatre productions including The New York Shakespeare Festival, The Roundabout and The Actors Theatre of Louisville. In 1995, he was hired by Nicholas Hytner (The Madness of King George (1994)) to play Jigger Craigin in the National Tour of \"Carousel\" with Patrick Wilson (Hard Candy (2005)).\nIn front of the camera, Rickaby has demonstrated a wide range of looks and sensibilities but is mostly known for playing a variety of psychopaths, sociopaths and other disturbed individuals.", 
  "birthday": "1964-12-15", 
  "deathday": "", 
  "homepage": "http://www.brettrickaby.com/", 
  "id": 12549, 
  "imdb_id": "nm0725434", 
  "name": "Brett Rickaby", 
  "place_of_birth": "Shafer - Minnesota - USA", 
  "popularity": 0.110565, 
  "profile_path": "/bsY5Tgy6PTPa4u81eaVIgTs5RwA.jpg"
}