{
  "adult": false, 
  "also_known_as": [
    "Michael P. McGill", 
    "Mike McGill", 
    "Michael McGill"
  ], 
  "biography": "Michael Patrick McGill is the first of two sons born to Anne McGill and the late Gerald F. McGill, Jr. His brother Patrick was born in 1976. Mike grew up in the Fox River Valley and graduated from Appleton East High School in 1991. He attended The University of Wisconsin at Stevens Point from 1991 to 1993, when he took a break from his studies and enlisted in the U.S. Army Reserve. He attended Basic Training at Fort Jackson, South Carolina and A.I.T. at Fort Bragg, North Carolina. He transferred to The University of Wisconsin at Oshkosh upon his return, where he graduated in 1995 with a degree in Radio/TV/Film.\n\nMike belonged to the 432nd Civil Affairs Battalion in Green Bay, Wisconsin. His Army Reserve Unit was one of the first to be activated for Operation Joint Endeavor after the Dayton Peace Accord was signed. He spent January through July 1996 stationed overseas in Durdevik, Bosnia-Herzegovina.\n\nAfter his tour was over, Mike found work in the production department for WLUK-TV 11, the FOX affiliate in Green Bay, Wisconsin. His duties included running the audio board during the newscasts and inserting local commercial breaks in-between programs. One of the perks that came along with the job was getting paid to witness The Green Bay Packers march towards their Super Bowl XXXI victory over the New England Patriots.\n\nFittingly, Mike's first full day as a resident of Los Angeles was April 1st, 1998 (April Fool's Day). His first TV program appearance was a small role as \"Babe Ruth\" in a flashback on an episode of \"Touched by an Angel\" (1994). He lives with his wife Amy, their son Jake and their dog Elvis in the San Fernando Valley, where he continues to further his acting career.", 
  "birthday": "1973-07-02", 
  "deathday": "", 
  "homepage": "", 
  "id": 154816, 
  "imdb_id": "nm1042946", 
  "name": "Michael Patrick McGill", 
  "place_of_birth": "Appleton - Wisconsin - USA", 
  "popularity": 1e-06, 
  "profile_path": "/9M7pqxB3NZm7zVrpGqFkFI25nrw.jpg"
}