{
  "adult": false, 
  "also_known_as": [], 
  "biography": "Born and raised in Burgettstown, Pennsylvania, a small town near \nPittsburgh. He is the middle son of Petro and Despina Maropis and is \nvery close to his brothers, Sam and Chris.\n\nBeing an exceptional \nall-around athlete in high school (Burgettstown High-school in southwest\n Pennsylvania), it appeared Adoni would pursue a professional career in \nsome sport. Turning down various athletic scholarships, he enrolled at \nWest Virginia University and graduated magna cum laude with a Bachelor's\n Degree in Business Administration.\n\nBut, from years of being \nentertained by Adoni's impromptu comedic performances and impersonations\n which began when he was a small child, his father, Petro, told him that\n the suit and tie of the business world would probably choke him to \ndeath and encouraged Adoni to give acting a shot. Surprised, yet \nintrigued at this suggestion, Adoni enrolled at a performing arts \nschool, Point Park College (now a University) in Pittsburgh, and studied\n acting, dialects, singing, and a bit of dance.\n\nHis first stage \nrole was as a freshman, even though freshman weren't allowed to perform \nat the time, where they needed him as an \"Arabian Carrier\" in The \nNutcracker Sweet. Not only did Adoni get to flex his muscles in that \nrole, but he also played the \"Jack-in-the-Box\" in the same production. \nSome of his other memorable plays and musicals were: Working, Evita, \nGetting Out, You Can't Take it With You, and Little Shop of Horrors \nwhere he played the man-eating plant, \"Audrey II.\" After three years of \ntheatre at Point Park, with the help of his younger brother Chris, he \nheaded for Hollywood.\n\nAlthough Adoni is truly blessed with a more\n than usual dose of athletic ability and creative talent, what truly \nmakes Adoni stand out is that he is a Type 1 Diabetic, and has been \nsince he was 18 months old. His parents were told he would be weak and \nsickly, and in and out of hospitals his whole life. Ultimately, a \nrenowned diabetic specialist told his father that most likely Adoni \nwould be dead by the age of 25. As Adoni puts it, \"I get a kick out of \nsomeone saying I can't do it.\" This has been proven by his numerous \nathletic awards \nand championships throughout high-school and college which involved \neverything - strength, speed, quickness and finesse. The list includes: \ntennis, basketball, baseball, football, weightlifting, arm-wrestling, \nfitness, and his favorite pastime, which is table tennis (ping-pong). \nAdoni loves being creative with his workouts which involve only 30-45 \nminutes per day of either running, biking, aerobics, some martial arts, \nor what he calls his \"unique, unnatural, yet truly natural Cirque du \nSoleil/Tarzan workout\".\n\nSome of Adoni's diverse and memorable roles include: the flamboyant evil sorcerer, Quan Chi, in the TV show \"Mortal Kombat: Conquest\" (1998), the sarcastic undercover agent in The Gristle (2001), \"Abu-Fayed,\" in Season 6 of the Fox hit series \"24\" (2001) and the regal falcon-man in Hidalgo (2004), starring Viggo Mortensen.  An\n inspiration to the world, Adoni will tell you that the most important \ningredients to success and happiness are - love, laughter, and fitness! \nHe credits his family and a few good friends with supplying all three.", 
  "birthday": "1963-07-20", 
  "deathday": "", 
  "homepage": "", 
  "id": 20808, 
  "imdb_id": "nm0549538", 
  "name": "Adoni Maropis", 
  "place_of_birth": "Pittsburgh, Pennsylvania, USA", 
  "popularity": 5e-06, 
  "profile_path": "/np8iLJmgKPLaX5kLXAKVc273HHH.jpg"
}