{
  "adult": false, 
  "also_known_as": [], 
  "biography": "​From Wikipedia, the free encyclopedia.\n\nAshanti Shequoiya Douglas born October 13, 1980 is an American recording artist, record producer and actress who rose to fame in the early 2000s. Ashanti is most famous for her eponymous debut album, which featured the hit song \"Foolish\", and sold over 503,000 copies in its first week of release throughout the U.S. in April 2002. The album set a Soundscan record as the biggest opening week sales for a new female artist, outselling debuts by Alicia Keys and Lauryn Hill. In the same week, she became the first female performer to simultaneously hold the top two places on the Billboard Hot 100 singles chart with \"Foolish\", and \"What's Luv?\" (with Fat Joe). Ashanti broke records again by having three top ten songs, \"Foolish,\" \"What's Luv?\" and \"Always on Time\", on the Billboard Hot 100 charts in the same week, being the first woman to accomplish this feat and being second only to the Beatles. In 2003, the self-titled debut album won Ashanti her first Grammy Award for Best Contemporary R&B album. As of 2008, she has sold more than 27 million albums worldwide. Ashanti ended the decade (2000–09) as the third top new R&B artist behind Alicia Keys and Beyonce Knowles. She also ended the decade at number 38 on the Top Artist of the Decade list. As of 2010, Ashanti is listed in the 20 Best Selling Music Singles Since 1990 in History. She ranked #17, with Foolish selling more than 7.4 million copies in the U.S.\nAshanti sang background vocals for Jennifer Lopez on \"I'm Real (Murder Remix)\" and wrote and sang background on the song \"Ain't It Funny (Murder Remix)\" sung by Jennifer Lopez, both reaching number one on Billboard Hot 100 , which was also in the top 10 charts at the same time as \"Foolish\", \"Always on Time\" (with Ja Rule), and \"What's Luv\" (with Fat Joe). Later that year, she was acclaimed as the \"Princess Of Hip-Hop & R&B\" by her label and capped off her successful debut by winning eight Billboard awards and two American Music Awards. Within seven years of Ashanti's career, she has scored 16 top 40 hits on the Hot 100. Ashanti has endorsed numerous products including Gap, Herbal Essences and Mudd Jeans.\nAshanti cites Janet Jackson, Prince, Madonna, Tupac Shakur, Aaliyah, Tamia, Mary J. Blige, Ella Fitzgerald, Peggy Lee, Yolanda Adams, Toni Braxton, Luther Vandross, The Beatles, The Clark Sisters, Smokey Robinson, Donna Summer, and Blue Magic as her musical influences. Praised as a gifted songwriter by her peers and critics alike, Ashanti has written/co-written the bulk of all her music. She is currently working on her own publishing company entitled Written Entertainment. She released her fourth studio album entitled The Declaration on June 3, 2008 and is currently in the studio working on her fifth. She also performed the charity tune \"Just Stand Up\" alongside 14 other female singers for the \"Stand Up to Cancer\" live television special which helped raise $100 million dollars for cancer research\n\nDescription above from the Wikipedia article Ashanti, licensed under CC-BY-SA, full list of contributors on Wikipedia", 
  "birthday": "1980-10-13", 
  "deathday": "", 
  "homepage": "", 
  "id": 57172, 
  "imdb_id": "nm1215338", 
  "name": "Ashanti", 
  "place_of_birth": "Glen Cove, Long Island, New York, USA", 
  "popularity": 1.05, 
  "profile_path": "/lN5YrFFhCmxvX22Ts9hmzTMYblY.jpg"
}