{
  "adult": false, 
  "also_known_as": [
    "KD Aubert", 
    "K.D. Aubert"
  ], 
  "biography": "Model & Actress KD Aubert started her modeling career with LA Models in 2001. As a runway model working overseas, she soon ventured into print modeling with Elite models (LA) where she was thrust into major campaigns. Soon after KD entered into the world of commercials where again, she was lucky enough into land some very memorable campaigns. In 2002, while hosting the MTV show Kidnapped with Dave Holmes, she landed her first major role, not surprisingly on her first audition, in the cult classic Friday After Next, followed shortly after with a role in The Scorpion King. The following year she replaced a recurring actress on the hit show Buffy the Vampire Slayer (aka Nikki Wood). While shooting Buffy, KD landed a leading role in the movie Hollywood Homicide starring Harrison Ford and Josh Hatrnett. She has also starred on independent movies such as Dysenchanted (starring Jim Belushi) and Easy. KD also starred alongside Kevin Hart, Tom Arnold and many other superstars while on the comedy Soul Plane. After shooting what was one her favorite sci-fi movies Frankenfish in Mobile, Alabama, she returned to LA to snatch a guest star role on FOX's Bones.  Life in Politics In 2007, while recording music and partly residing in Chicago, she volunteered at Obama headquarters where she met Arne Duncan and Rahm Emmanuel. As a Democrat, KD will always stand with the people, especially those less fortunate. KD feels what makes America great, is the way we have always been able to look out for one another and lend a helping hand.  Charities KD enjoys working alongside some very influential non-profit organizations, such as Urban Born out of Los Angeles, and the Sickle Cell Disease Foundation of California. Two of KD's sisters live with the Sickle Cell Disease and the foundation truly helped from childhood to now. In addition, KD works closely with the Charlie Mack Foundation out of Philadelphia, PA. Will Smith and his dear friend, Charlie Mack, founded this foundation. Every year KD is called upon to travel to Philly to visit with kids who suffer from illnesses at local medical facilities. She visits young kids and teens that have been incarcerated as well as host fun events for the inner city youths.  Hobbies Aubert's hobbies include: playing golf, tennis, watching CNN & MSNBC, traveling, eating exotic foods, writing songs, spending time with family, going to the batting cages, and fishing to name a few.  Religion KD's religious views are called \"non-denominational\" with a Christian foundation. She attends a worship center called \"Agape\" which means unconditional love.", 
  "birthday": "1978-12-06", 
  "deathday": "", 
  "homepage": "", 
  "id": 73830, 
  "imdb_id": "nm1147702", 
  "name": "K. D. Aubert", 
  "place_of_birth": "Shreveport, Louisiana, USA", 
  "popularity": 0.997021, 
  "profile_path": "/4UbawS5K0hL31DLKhZIKYsqhvhf.jpg"
}