{
  "adult": false, 
  "also_known_as": [
    "Amy Lou Adams"
  ], 
  "biography": "From Wikipedia, the free encyclopedia.\n\nAmy Lou Adams (born August 20, 1974, height 5' 4\" (1,63 m)) is an American actress and singer. She has been nominated for five Academy Awards, five Golden Globes (winning one), six Screen Actors Guild Awards, four BAFTA Awards, and nine BFCA Awards (winning four). Adams was born to American parents in Vicenza, Italy, and began her performing career on stage in dinner theaters, before making her screen debut in the 1999 black comedy film Drop Dead Gorgeous.\n\nAfter a series of television guest appearances and roles in B movies, she was cast in the role of Brenda Strong in 2002's Catch Me If You Can, but her breakthrough role was in the 2005 independent film Junebug, playing Ashley Johnsten, for which she received critical acclaim and an Academy Award nomination for Best Supporting Actress. Adams subsequently starred in Disney's 2007 film Enchanted, a critical and commercial success, and received a Golden Globe Award nomination for her performance as Giselle. She received her second Academy Award and Golden Globe Award nominations the following year for her role as a young nun in Doubt.\n\nIn 2009, Adams portrayed Amelia Earhart in the highly successful adventure film Night at the Museum: Battle of the Smithsonian, and starred as writer Julie Powell in the comedy-drama film Julie &amp; Julia. She received two more Golden Globes, BAFTA, and Academy Award nominations for her roles in the 2010 sports drama The Fighter and the 2012 psychological drama The Master. Adams achieved further success in 2013 for portraying Lois Lane in the Superman movie Man of Steel and a con artist in American Hustle; the latter earned her the Golden Globe Award for Best Actress in a Musical or Comedy and her fifth Academy Award nomination, this time for Best Actress.", 
  "birthday": "1974-08-20", 
  "deathday": "", 
  "homepage": "", 
  "id": 9273, 
  "imdb_id": "nm0010736", 
  "name": "Amy Adams", 
  "place_of_birth": "Vicenza - Veneto - Italy", 
  "popularity": 7.007557, 
  "profile_path": "/tk5eWJcOBr9uRefeUm9ntvehbLA.jpg"
}